posts/2024/02/03/getting-email.org
# -*- org-attach-id-dir: "../../../../files/attachments"; -*-
#+BEGIN_COMMENT
.. title: Local email from Office365 using OAUTH2 with mbsync
.. slug: getting-email
.. date: 2024-02-03 16:19:40 UTC
.. tags: emacs, sysadmin, email, linux
.. category:
.. link:
.. description:
.. type: text

#+END_COMMENT
* Local email from Office365 using OAUTH2 with ~mbsync~

  I decided recently I wanted to have a more controlled email setup,
  with a local archive rather than relying on remote servers
  to keep everything. The point of this is twofold:

  1. To have a local archive of email, separate from the corporate
     servers in case I need to change provider etc
  2. To use different MUAs locally, rather than being stuck with only
     a few that will work with all the providers and that are clunky
     and not well-integrated with my workflow


  There's a lot of outdated information on the web about how to set
  this up and it took some time for me to get a working setup, so I
  thought I'd share my experience. Specifically this involves
  interfacing command-line email receiving and sending to a Microsoft
  Office365 server using IMAP and SMTP with corporate-grade OAUTH2 2FA
  authentication: it's the last part that's tricky. As a bonus the
  same approach also works for OAUTH2 and Gmail, dispensing with
  insecure application passwords.

  In case it's not obvious by now, this is a hacker set-up that
  requires quite a lot of technical manual configuration.


** How the internet email architecture works

   The old-school approach to email involves several elements, each
   potentially provided by a different tool:

   - a client program or /mail user agent/ (MUA) that presents email
     to you and lets you search, delete, store, etc;
   - a retrieval program or /mail delivery agent/ (MDA) that retrieves
     mail from the providers and manages local email directories
   - a sending program or /mail transfer agent/ (MTA) that takes; and
     locally-created messages and transfer them to their intended
     recipients.


   Modern GUI email clients like Thunderbird typically wrap-up all
   three services into one program that's easier to deploy and manage,
   but that therefore forces certain choices on the user. By reverting
   to the older architecture we regain flexibility and choice, at the
   expense of making our lives harder.

   All these tools need to authenticate against other services.
   Traditionally this used usernames and passwords, which are clearly
   inadequate for the modern web. Instead we need a system based
   around stronger encryption.

   [[https://en.wikipedia.org/wiki/OAuth][OAUTH2]] is a an authorisation delegation protocol that lets a site
   grant access to someone who's authenticated against another,
   without getting sight of their credentials. The typical use case is
   for a web site to allow users to sign-in using social media
   services like Facebook or Google, which reduces the number of
   passwords a user needs to remember or manage -- and, totally
   incidentally I'm sure, improves the social media services' ability
   to track users' activities across the web.

   In our case, the OAUTH2 "flow" interacts with the authentication
   provider and acquires a bearer token that can then be presented to
   authorise access to the various email services.

** Outline solution

   In outline the solution is as follows:

   1. Install ~mbsync~ as MDA
   2. Set up OAUTH2 authentication for Office365
   3. Use the to authenticate ~mbsync~ against Office365 to allow
      retrieval
   4. Install ~msmtp~ as MTA, using the same authentication scheme
   5. Install ~mu4e~ as MUA, since I want to read my email from inside
      Emacs

** Packages

   Under Arch Linux we need the ~isync~ package for synchronisation
   and the ~cyrus-sasl-xoauth2~ provider for OAUTH authentication.

   #+begin_src bash
sudo pacman -S isync
yay -S cyrus-sasl-xoauth2
   #+end_src

   The same packages are available for other distros under similar
   names. Note that the actual synchronisation tool is called
   ~mbsync~, even though the package that contains it is called
   ~isync~.

