2024/02/03/getting-email/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Local email from Office365 using OAUTH2 with mbsync | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Saturday 3 February, 2024</a>
	    </span>
	</div>
	<h1>Local email from Office365 using <span class="caps">OAUTH2</span> with&nbsp;mbsync</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgc13f1ab" class="outline-2">
<h2 id="orgc13f1ab">Local email from Office365 using <span class="caps">OAUTH2</span>&nbsp;with <code>mbsync</code>
</h2>
<div class="outline-text-2" id="text-orgc13f1ab">
<p>
I decided recently I wanted to have a more controlled email setup,
with a local archive rather than relying on remote servers
to keep everything. The point of this is&nbsp;twofold:
</p>

<ol class="org-ol">
<li>To have a local archive of email, separate from the corporate
servers in case I need to change provider&nbsp;etc</li>
<li>To use different MUAs locally, rather than being stuck with only
a few that will work with all the providers and that are clunky
and not well-integrated with my&nbsp;workflow</li>
</ol>
<p>
There&#8217;s a lot of outdated information on the web about how to set
this up and it took some time for me to get a working setup, so I
thought I&#8217;d share my experience. Specifically this involves
interfacing command-line email receiving and sending to a Microsoft
Office365 server using <span class="caps">IMAP</span> and <span class="caps">SMTP</span> with corporate-grade <span class="caps">OAUTH2</span> <span class="caps">2FA</span>
authentication: it&#8217;s the last part that&#8217;s tricky. As a bonus the
same approach also works for <span class="caps">OAUTH2</span> and Gmail, dispensing with
insecure application&nbsp;passwords.
</p>

<p>
In case it&#8217;s not obvious by now, this is a hacker set-up that
requires quite a lot of technical manual&nbsp;configuration.
</p>
</div>


<div id="outline-container-orge41cd06" class="outline-3">
<h3 id="orge41cd06">How the internet email architecture&nbsp;works</h3>
<div class="outline-text-3" id="text-orge41cd06">
<p>
The old-school approach to email involves several elements, each
potentially provided by a different&nbsp;tool:
</p>

<ul class="org-ul">
<li>a client program or <i>mail user agent</i> (<span class="caps">MUA</span>) that presents email
to you and lets you search, delete, store,&nbsp;etc;</li>
<li>a retrieval program or <i>mail delivery agent</i> (<span class="caps">MDA</span>) that retrieves
mail from the providers and manages local email&nbsp;directories</li>
<li>a sending program or <i>mail transfer agent</i> (<span class="caps">MTA</span>) that takes; and
locally-created messages and transfer them to their intended&nbsp;recipients.</li>
</ul>
<p>
Modern <span class="caps">GUI</span> email clients like Thunderbird typically wrap-up all
three services into one program that&#8217;s easier to deploy and manage,
but that therefore forces certain choices on the user. By reverting
to the older architecture we regain flexibility and choice, at the
expense of making our lives&nbsp;harder.
</p>

<p>
All these tools need to authenticate against other services.
Traditionally this used usernames and passwords, which are clearly
inadequate for the modern web. Instead we need a system based
around stronger&nbsp;encryption.
</p>

<p>
<a href="https://en.wikipedia.org/wiki/OAuth"><span class="caps">OAUTH2</span></a> is a an authorisation delegation protocol that lets a site
grant access to someone who&#8217;s authenticated against another,
without getting sight of their credentials. The typical use case is
for a web site to allow users to sign-in using social media
services like Facebook or Google, which reduces the number of
passwords a user needs to remember or manage – and, totally
incidentally I&#8217;m sure, improves the social media services&#8217; ability
to track users&#8217; activities across the&nbsp;web.
</p>

<p>
In our case, the <span class="caps">OAUTH2</span> &#8220;flow&#8221; interacts with the authentication
provider and acquires a bearer token that can then be presented to
authorise access to the various email&nbsp;services.
</p>
</div>
</div>

<div id="outline-container-orgb742b0e" class="outline-3">
<h3 id="orgb742b0e">Outline&nbsp;solution</h3>
<div class="outline-text-3" id="text-orgb742b0e">
<p>
In outline the solution is as&nbsp;follows:
</p>

<ol class="org-ol">
<li>Install <code>mbsync</code> as&nbsp;<span class="caps">MDA</span></li>
<li>Set up <span class="caps">OAUTH2</span> authentication for&nbsp;Office365</li>
<li>Use the to&nbsp;authenticate <code>mbsync</code> against Office365 to allow&nbsp;retrieval</li>
<li>Install <code>msmtp</code> as <span class="caps">MTA</span>, using the same authentication&nbsp;scheme</li>
<li>Install <code>mu4e</code> as <span class="caps">MUA</span>, since I want to read my email from inside&nbsp;Emacs</li>
</ol>
</div>
</div>

<div id="outline-container-orgcda19bf" class="outline-3">
<h3 id="orgcda19bf">Packages</h3>
<div class="outline-text-3" id="text-orgcda19bf">
<p>
Under Arch Linux we need&nbsp;the <code>isync</code> package for synchronisation
and&nbsp;the <code>cyrus-sasl-xoauth2</code> provider for <span class="caps">OAUTH</span>&nbsp;authentication.
</p>

<div class="highlight"><pre><span></span>   sudo pacman -S isync
   yay -S cyrus-sasl-xoauth2
</pre></div>

<p>
The same packages are available for other distros under similar
names. Note that the actual synchronisation tool is&nbsp;called
<code>mbsync</code>, even though the package that contains it is&nbsp;called
<code>isync</code>.
</p>
</div>
</div>
