posts/2024/02/03/getting-email.org
** OAUTH2 flow management

   We want to use OAUTH2 to authenticate an IMAP transaction, so that
   no additional passwords are needed. To this we need a script to
   manage the OAUTH2 flow.

   Weirdly for an operation that's becoming so common on the web,
   there doesn't seem to be a package that offers OAUTH2 from the
   command line. However, there /is/ a script that does it that's
   included as an example with the ~mutt~ MUA, and we can use that. It
   can be found (in Arch) in the ~mutt~ package.

   #+begin_src bash
sudo pacman -S mutt
cp /usr/share/doc/mutt/samples/mutt_oauth2.py .
   #+end_src

   This puts a copy of the script into the current directory, which we
   can then edit in two ways:

   - add the internal application identification and client secrets
     for accessing Office365; and
   - set up the security for the OAUTH2 access tokens when they're
     downloaded and held locally.


   The client secret and app id need to be "proper", in the sense that
   Office365 knows about them -- but weirdly they /don't/ have to be
   related to your email domain or cloud tenancy. It's perfectly fine
   to use credentials available in the public domain, for example
   those of Thunderbird:

   #+begin_src python
AppID = "08162f7c-0fd2-4200-a84a-f25a4db0b584"
ClientSecret = "TxRBilcHdC6WGBee]fs?QR:SJ8nI[g82"
   #+end_src

   (I got these from [[https://www.dcs.gla.ac.uk/~jacobd/posts/2022/03/configure-mutt-to-work-with-oauth-20/][here]], but other than that have no idea where
   they come from: they're /not/ the same as those in the
   [[https://hg.mozilla.org/comm-central/file/tip/mailnews/base/src/OAuth2Providers.jsm][Thunderbird source code]], as far as I can tell.)

   The ~mutt_oauth2.py~ script stores the tokens it manages in a
   ~gpg~-encrypted file. You therefore need to provide your ~gpg~
   keypair identification, and I'm assuming anyone wanting to get
   local email has one of those! Mine is "simoninireland".


   #+begin_src python
GPGKey = "simoninireland"
   #+end_src

   I edited the file to look like this, with some details elided:

   #+begin_src python
MSAppID = "08162f7c-0fd2-4200-a84a-f25a4db0b584"
MSClientSecret = "TxRBilcHdC6WGBee]fs?QR:SJ8nI[g82"
GPGKey = "simoninireland"

ENCRYPTION_PIPE = ['gpg', '--encrypt', '--recipient', GPGKey]
DECRYPTION_PIPE = ['gpg', '--decrypt']

registrations = {
    'google': {
	...
	'client_id': '',
	'client_secret': '',
    },
    'microsoft': {
	...
	'client_id': MSAppID,
	'client_secret': MSClientSecret,
    },
}
   #+end_src

   Put resulting script into ~/usr/local/bin~ and make it executable.
   Then run it in "authorisation" mode. The token file can go
   anywhere: I put it in the directory used by ~pass~ to allow for an
   alternative access route:

   #+begin_src bash
mutt_oauth2.py -t .password-store/email/work.gpg --authorize
   #+end_src

   This will ask some questions:

   - we want "microsoft" authentication
   - and a "localhostauthcode" flow
   - enter your email address (the actual user, not any alias)


   and it prints out a URL to copy into a browser to authenticate
   against Office365's web interface. In my case this involved
   interacting with the university's single sign-on and two-factor
   authentication (2FA) system. Doing this successfully put the
   necessary OAUTH2 tokens, encrypted, into the specified file.
   Running:

   #+begin_src bash
mutt_oauth2.py -t .password-store/email/work.gpg
   #+end_src

   will output the token, refreshing it automatically if it's
   expired. This may ask for the GPG key's passphrase, if it has one,
   and if it's not available from a local key agent.

   (All this security means that the bearer tokens are stored
   encryoted at rest. It's a little inconvenient, though, as it means
   you need to enter a ~gpg~ passphrase periodically, and makes it
   hard to run ~mbsync~ in a ~cron~ job. This is fine if, like me,
   your level of security paranoia is such that you accept the minor
   inconvenience in exchange for not having plain-text access tokens
   lying around; on the other hand, you may decide that using, for
   example, a machine with full-disc encryption is secure enough, in
   which case you need to edit the ~ENCRYPTION_PIPE~ and
   ~DECRYPTION_PIPE~ commands in the script to not do encryption: they
   can basically just use ~cat~ to store and retrieve the token information.)

** ~mbsync~ for Office365

   We now have OAUTH2 tokens for accessing Office365, which we can
   integrate with our MDA. ~mbsync~ has four main concepts:

   - Accounts, typically using IMAP
   - IMAP message stores, which are remote
   - Maildir stores, which are local
   - Channels, which tie local and remote together


   [[https://en.wikipedia.org/wiki/Maildir][Maildir]] is a file format for storing email in a directory
   structure, and is a long-running standard that's supported by lots
   of tools. A maildir is typically presented in the MUA to a user as
   a folder, and represented to the MDA as a directory.

   For Office365 we have:

   #+begin_src fundamental
IMAPAccount work
Host outlook.office365.com
Port 993
User <<work-email>>
PassCmd "mutt_oauth2.py -t ~/.password-store/email/work.gpg"
AuthMechs XOAUTH2
SSLType IMAPS

IMAPStore work-remote
Account work

MaildirStore work-local
Subfolders Verbatim
Path ~/Maildir/Work/
Inbox ~/Maildir/Work/Inbox

Channel Work
Far :work-remote:
Near :work-local:
Patterns * !"Conversation History" !Calendar !Archive !Archives !Clutter !Drafts
Create Both
Expunge Both
SyncState *
   #+end_src

   (See the ~mbsync~ man pages for the details of its configuration.
   ~<<work-email>>~ should be a a proper username, not an alias.)
   For our purposes the important line is the ~PassCmd~ that calls our
   edited script to retrieve the OAUTH2 bearer token. Email will be
   downloaded into a maildir tree rooted at ~~/Maildir/Work~: you need
   to create this before sync-ing.

   #+begin_src bash
mkdir -p ~/Maildir/Work
   #+end_src

