2024/02/03/getting-email/index.html

<div id="outline-container-org9922c7f" class="outline-3">
<h3 id="org9922c7f"><span class="caps">OAUTH2</span> flow&nbsp;management</h3>
<div class="outline-text-3" id="text-org9922c7f">
<p>
We want to use <span class="caps">OAUTH2</span> to authenticate an <span class="caps">IMAP</span> transaction, so that
no additional passwords are needed. To this we need a script to
manage the <span class="caps">OAUTH2</span>&nbsp;flow.
</p>

<p>
Weirdly for an operation that&#8217;s becoming so common on the web,
there doesn&#8217;t seem to be a package that offers <span class="caps">OAUTH2</span> from the
command line. However, there <i>is</i> a script that does it that&#8217;s
included as an example with&nbsp;the <code>mutt</code> <span class="caps">MUA</span>, and we can use that. It
can be found (in Arch) in&nbsp;the <code>mutt</code> package.
</p>

<div class="highlight"><pre><span></span>   sudo pacman -S mutt
   cp /usr/share/doc/mutt/samples/mutt_oauth2.py .
</pre></div>

<p>
This puts a copy of the script into the current directory, which we
can then edit in two&nbsp;ways:
</p>

<ul class="org-ul">
<li>add the internal application identification and client secrets
for accessing Office365;&nbsp;and</li>
<li>set up the security for the <span class="caps">OAUTH2</span> access tokens when they&#8217;re
downloaded and held&nbsp;locally.</li>
</ul>
<p>
The client secret and app id need to be &#8220;proper&#8221;, in the sense that
Office365 knows about them – but weirdly they <i>don&#8217;t</i> have to be
related to your email domain or cloud tenancy. It&#8217;s perfectly fine
to use credentials available in the public domain, for example
those of&nbsp;Thunderbird:
</p>

<div class="highlight"><pre><span></span>   <span class="n">AppID</span> <span class="o">=</span> <span class="s2">"08162f7c-0fd2-4200-a84a-f25a4db0b584"</span>
   <span class="n">ClientSecret</span> <span class="o">=</span> <span class="s2">"TxRBilcHdC6WGBee]fs?QR:SJ8nI[g82"</span>
</pre></div>

<p>
(I got these from <a href="https://www.dcs.gla.ac.uk/~jacobd/posts/2022/03/configure-mutt-to-work-with-oauth-20/">here</a>, but other than that have no idea where
they come from: they&#8217;re <i>not</i> the same as those in the
<a href="https://hg.mozilla.org/comm-central/file/tip/mailnews/base/src/OAuth2Providers.jsm">Thunderbird source code</a>, as far as I can&nbsp;tell.)
</p>

<p>
The <code>mutt_oauth2.py</code> script stores the tokens it manages in&nbsp;a
<code>gpg</code>-encrypted file. You therefore need to provide&nbsp;your <code>gpg</code>
keypair identification, and I&#8217;m assuming anyone wanting to get
local email has one of those! Mine is&nbsp;&#8220;simoninireland&#8221;.
</p>


<div class="highlight"><pre><span></span>   <span class="n">GPGKey</span> <span class="o">=</span> <span class="s2">"simoninireland"</span>
</pre></div>

<p>
I edited the file to look like this, with some details&nbsp;elided:
</p>

<div class="highlight"><pre><span></span>   <span class="n">MSAppID</span> <span class="o">=</span> <span class="s2">"08162f7c-0fd2-4200-a84a-f25a4db0b584"</span>
   <span class="n">MSClientSecret</span> <span class="o">=</span> <span class="s2">"TxRBilcHdC6WGBee]fs?QR:SJ8nI[g82"</span>
   <span class="n">GPGKey</span> <span class="o">=</span> <span class="s2">"simoninireland"</span>

   <span class="n">ENCRYPTION_PIPE</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'gpg'</span><span class="p">,</span> <span class="s1">'--encrypt'</span><span class="p">,</span> <span class="s1">'--recipient'</span><span class="p">,</span> <span class="n">GPGKey</span><span class="p">]</span>
   <span class="n">DECRYPTION_PIPE</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'gpg'</span><span class="p">,</span> <span class="s1">'--decrypt'</span><span class="p">]</span>

   <span class="n">registrations</span> <span class="o">=</span> <span class="p">{</span>
       <span class="s1">'google'</span><span class="p">:</span> <span class="p">{</span>
           <span class="o">...</span>
           <span class="s1">'client_id'</span><span class="p">:</span> <span class="s1">''</span><span class="p">,</span>
           <span class="s1">'client_secret'</span><span class="p">:</span> <span class="s1">''</span><span class="p">,</span>
       <span class="p">},</span>
       <span class="s1">'microsoft'</span><span class="p">:</span> <span class="p">{</span>
           <span class="o">...</span>
           <span class="s1">'client_id'</span><span class="p">:</span> <span class="n">MSAppID</span><span class="p">,</span>
           <span class="s1">'client_secret'</span><span class="p">:</span> <span class="n">MSClientSecret</span><span class="p">,</span>
       <span class="p">},</span>
   <span class="p">}</span>
</pre></div>

<p>
Put resulting script&nbsp;into <code>/usr/local/bin</code> and make it executable.
Then run it in &#8220;authorisation&#8221; mode. The token file can go
anywhere: I put it in the directory used&nbsp;by <code>pass</code> to allow for an
alternative access&nbsp;route:
</p>

<div class="highlight"><pre><span></span>   mutt_oauth2.py -t .password-store/email/work.gpg --authorize
</pre></div>

<p>
This will ask some&nbsp;questions:
</p>

<ul class="org-ul">
<li>we want &#8220;microsoft&#8221;&nbsp;authentication</li>
<li>and a &#8220;localhostauthcode&#8221;&nbsp;flow</li>
<li>enter your email address (the actual user, not any&nbsp;alias)</li>
</ul>
<p>
and it prints out a <span class="caps">URL</span> to copy into a browser to authenticate
against Office365&#8217;s web interface. In my case this involved
interacting with the university&#8217;s single sign-on and two-factor
authentication (<span class="caps">2FA</span>) system. Doing this successfully put the
necessary <span class="caps">OAUTH2</span> tokens, encrypted, into the specified file.&nbsp;Running:
</p>

<div class="highlight"><pre><span></span>   mutt_oauth2.py -t .password-store/email/work.gpg
</pre></div>

<p>
will output the token, refreshing it automatically if it&#8217;s
expired. This may ask for the <span class="caps">GPG</span> key&#8217;s passphrase, if it has one,
and if it&#8217;s not available from a local key&nbsp;agent.
</p>

<p>
(All this security means that the bearer tokens are stored
encryoted at rest. It&#8217;s a little inconvenient, though, as it means
you need to enter&nbsp;a <code>gpg</code> passphrase periodically, and makes it
hard to&nbsp;run <code>mbsync</code> in&nbsp;a <code>cron</code> job. This is fine if, like me,
your level of security paranoia is such that you accept the minor
inconvenience in exchange for not having plain-text access tokens
lying around; on the other hand, you may decide that using, for
example, a machine with full-disc encryption is secure enough, in
which case you need to edit&nbsp;the <code>ENCRYPTION_PIPE</code> and
<code>DECRYPTION_PIPE</code> commands in the script to not do encryption: they
can basically just&nbsp;use <code>cat</code> to store and retrieve the token&nbsp;information.)
</p>
</div>
</div>

<div id="outline-container-org5049d26" class="outline-3">
<h3 id="org5049d26">
<code>mbsync</code> for&nbsp;Office365</h3>
<div class="outline-text-3" id="text-org5049d26">
<p>
We now have <span class="caps">OAUTH2</span> tokens for accessing Office365, which we can
integrate with our&nbsp;<span class="caps">MDA</span>. <code>mbsync</code> has four main&nbsp;concepts:
</p>

<ul class="org-ul">
<li>Accounts, typically using&nbsp;<span class="caps">IMAP</span></li>
<li><span class="caps">IMAP</span> message stores, which are&nbsp;remote</li>
<li>Maildir stores, which are&nbsp;local</li>
<li>Channels, which tie local and remote&nbsp;together</li>
</ul>
<p>
<a href="https://en.wikipedia.org/wiki/Maildir">Maildir</a> is a file format for storing email in a directory
structure, and is a long-running standard that&#8217;s supported by lots
of tools. A maildir is typically presented in the <span class="caps">MUA</span> to a user as
a folder, and represented to the <span class="caps">MDA</span> as a&nbsp;directory.
</p>

<p>
For Office365 we&nbsp;have:
</p>

<div class="highlight"><pre><span></span>   IMAPAccount work
   Host outlook.office365.com
   Port 993
   User &lt;&lt;work-email&gt;&gt;
   PassCmd "mutt_oauth2.py -t ~/.password-store/email/work.gpg"
   AuthMechs XOAUTH2
   SSLType IMAPS

   IMAPStore work-remote
   Account work

   MaildirStore work-local
   Subfolders Verbatim
   Path ~/Maildir/Work/
   Inbox ~/Maildir/Work/Inbox

   Channel Work
   Far :work-remote:
   Near :work-local:
   Patterns * !"Conversation History" !Calendar !Archive !Archives !Clutter !Drafts
   Create Both
   Expunge Both
   SyncState *
</pre></div>

<p>
(See&nbsp;the <code>mbsync</code> man pages for the details of its&nbsp;configuration.
<code>&lt;&lt;work-email&gt;&gt;</code> should be a a proper username, not an alias.)
For our purposes the important line is&nbsp;the <code>PassCmd</code> that calls our
edited script to retrieve the <span class="caps">OAUTH2</span> bearer token. Email will be
downloaded into a maildir tree rooted&nbsp;at <code>~/Maildir/Work</code>: you need
to create this before&nbsp;sync-ing.
</p>

<div class="highlight"><pre><span></span>   mkdir -p ~/Maildir/Work
</pre></div>
</div>
</div>
