posts/2024/02/03/getting-email.org
** Sync'ing the email

   For a full sync of all maildirs just run:

   #+begin_src bash
mbsync -a
   #+end_src

   That can be time-consuming, as all the maildirs (/i.e./, folders)
   have to be visited -- and I have several hundred. A faster
   option is to normally just look at (for example) the inbox:

   #+begin_src bash
mbsync Work:INBOX
   #+end_src

   This will ignore everything else, which means they'll drift -- but
   can be re-sync'ed periodically by running a full sync. One could
   also set up a ~cron~ job to do a full sync early every morning, for
   example, as long as the access token was held unencrypted (see
   above).

** Indexing email

   You'll almost certainly now want to index your newly-downloaded
   trove of messages. There are two common tools for this ~mu~ and
   ~notmuch~. Both do basically the same job of maintaining a
   structured and full-text index of messages that can be queried by
   an appropriate MUA. I chose ~mu~, for no particular reason: some
   people swear by ~notmuch~, which is based on extensive tagging of
   messages and so might be more familiar to Gmail users.

   To install ~mu~, we first grab the package:

   #+begin_src bash
pacman -S mu
   #+end_src

   We then initialise the index by running the indexer over the
   maildir. If we also provide our own email address (or more than one) it knows to
   index these differently.

   #+begin_src bash
mu init -m ~/Maildir --my-address=<<work-email>>
   #+end_src

** Sending email

   All of the above sets up the MDA to /get/ mail: we now need to be
   able to /send/ mail. Fortunately we've already done most of the
   hard work needed to get this working.

   We need a local MTA, for which I chose ~msmtp~. It understands
   OAUTH2 natively. Installation in Arch is easy:

   #+begin_src bash
sudo pacman -S msmtp
   #+end_src

   It needs to be pointed at the Office365 SMTP server and provided
   with the OAUTH2 tokens, which are the same as we used above:

   #+begin_src fundamental
defaults
auth           on
tls            on
tls_starttls   on
tls_trust_file /etc/ssl/certs/ca-certificates.crt
logfile        ~/.msmtp.log

account        work
host           smtp.office365.com
port           587
auth           xoauth2
user           <<work-email>>
from           <<work-email>>
passwordeval   "mutt_oauth2.py -t ~/.password-store/email/work.gpg"

account default : work
   #+end_src

   Again, see the ~msmtp~ man pages for the details of this, and
   replace ~<<work-email>>~ as appropriate: the only interesting part
   from our current perspective is that the ~passwordeval~ line calls
   exactly the same script as we used above.

** Reading and writing email

   Finally we're ready to read email. I'll leave this to you: there
   are lots of text-based email clients around, notably [[http://www.mutt.org/][~mutt~]] that we
   encountered earlier. There's also [[https://www.djcbsoftware.nl/code/mu/mu4e.html][~mu4e~]] for reading email in
   Emacs, making use of the ~mu~ index; and [[https://notmuch.readthedocs.io/en/latest/man1/notmuch.html][~notmuch~]] also has [[http://www.mutt.org/][an
   Emacs interface]].

   I use ~mu4e~. There's a lot of documentation on the web for setting
   this up, all of which applies immediately to our new set-up: the
   MUA is entirely independent of the MDA and MTA, and simply needs to
   be pointed at the right directories and accounts.

** Accessing Gmail using OAUTH2

   Gmail lets one use "app passwords" for accessing using IMAP, but
   also supports OAUTH2, which is obviously more secure. The same
   approach as above works for Gmail too. The initial credentials are:

   #+begin_src python
GAppID = '406964657835-aq8lmia8j95dhl1a2bvharmfk3t1hgqj.apps.googleusercontent.com'
GClientSecret = 'kSmqreRr0qwBWJgbf5Y-PjSU'
   #+end_src

   ([[https://www.dcs.gla.ac.uk/~jacobd/posts/2022/03/configure-mutt-to-work-with-oauth-20/][Same source]] as above.) Edit these into the script and change the
   entries in the config files to call it to authenticate with an
   appropriate store, for example:

   #+begin_src bash
mutt_oauth2.py -t .password-store/email/personal.gpg --authorize
   #+end_src

   and similarly in the configurations of ~mbsync~ and ~msmtp~.

** Conclusion

   If you're still with me: congratulations, but you must /really/
   want to read your email old-school!

   For me, this has completely changed my relationship with email in
   ways I didn't expect. Using Emacs means typically not having the
   client visible all the time, which reduces the temptation to check
   all the time. Instead I can adopt a more structured approach and
   only check my email when I want to, which often means only three or
   four times a day. It's also made email easier to manage, for
   example by adding hyperlinks in my to-do list straight to messages
   that need attention, and adding some integrations with org mode to
   simplify email processing. Those are matters for another time,
   though.

