2024/02/03/getting-email/index.html

<div id="outline-container-orgb1e2ba6" class="outline-3">
<h3 id="orgb1e2ba6">Sync&#8217;ing the&nbsp;email</h3>
<div class="outline-text-3" id="text-orgb1e2ba6">
<p>
For a full sync of all maildirs just&nbsp;run:
</p>

<div class="highlight"><pre><span></span>   mbsync -a
</pre></div>

<p>
That can be time-consuming, as all the maildirs (<i>i.e.</i>, folders)
have to be visited – and I have several hundred. A faster
option is to normally just look at (for example) the&nbsp;inbox:
</p>

<div class="highlight"><pre><span></span>   mbsync Work:INBOX
</pre></div>

<p>
This will ignore everything else, which means they&#8217;ll drift – but
can be re-sync&#8217;ed periodically by running a full sync. One could
also set up&nbsp;a <code>cron</code> job to do a full sync early every morning, for
example, as long as the access token was held unencrypted (see&nbsp;above).
</p>
</div>
</div>

<div id="outline-container-orgc12eed5" class="outline-3">
<h3 id="orgc12eed5">Indexing&nbsp;email</h3>
<div class="outline-text-3" id="text-orgc12eed5">
<p>
You&#8217;ll almost certainly now want to index your newly-downloaded
trove of messages. There are two common tools for&nbsp;this <code>mu</code> and
<code>notmuch</code>. Both do basically the same job of maintaining a
structured and full-text index of messages that can be queried by
an appropriate <span class="caps">MUA</span>. I&nbsp;chose <code>mu</code>, for no particular reason: some
people swear&nbsp;by <code>notmuch</code>, which is based on extensive tagging of
messages and so might be more familiar to Gmail&nbsp;users.
</p>

<p>
To&nbsp;install <code>mu</code>, we first grab the&nbsp;package:
</p>

<div class="highlight"><pre><span></span>   pacman -S mu
</pre></div>

<p>
We then initialise the index by running the indexer over the
maildir. If we also provide our own email address (or more than one) it knows to
index these&nbsp;differently.
</p>

<div class="highlight"><pre><span></span>   mu init -m ~/Maildir --my-address=&lt;&lt;work-email&gt;&gt;
</pre></div>
</div>
</div>

<div id="outline-container-orga845751" class="outline-3">
<h3 id="orga845751">Sending&nbsp;email</h3>
<div class="outline-text-3" id="text-orga845751">
<p>
All of the above sets up the <span class="caps">MDA</span> to <i>get</i> mail: we now need to be
able to <i>send</i> mail. Fortunately we&#8217;ve already done most of the
hard work needed to get this&nbsp;working.
</p>

<p>
We need a local <span class="caps">MTA</span>, for which I&nbsp;chose <code>msmtp</code>. It understands
<span class="caps">OAUTH2</span> natively. Installation in Arch is&nbsp;easy:
</p>

<div class="highlight"><pre><span></span>   sudo pacman -S msmtp
</pre></div>

<p>
It needs to be pointed at the Office365 <span class="caps">SMTP</span> server and provided
with the <span class="caps">OAUTH2</span> tokens, which are the same as we used&nbsp;above:
</p>

<div class="highlight"><pre><span></span>   defaults
   auth           on
   tls            on
   tls_starttls   on
   tls_trust_file /etc/ssl/certs/ca-certificates.crt
   logfile        ~/.msmtp.log

   account        work
   host           smtp.office365.com
   port           587
   auth           xoauth2
   user           &lt;&lt;work-email&gt;&gt;
   from           &lt;&lt;work-email&gt;&gt;
   passwordeval   "mutt_oauth2.py -t ~/.password-store/email/work.gpg"

   account default : work
</pre></div>

<p>
Again, see&nbsp;the <code>msmtp</code> man pages for the details of this, and&nbsp;replace <code>&lt;&lt;work-email&gt;&gt;</code> as appropriate: the only interesting part
from our current perspective is that&nbsp;the <code>passwordeval</code> line calls
exactly the same script as we used&nbsp;above.
</p>
</div>
</div>

<div id="outline-container-org28e1ed6" class="outline-3">
<h3 id="org28e1ed6">Reading and writing&nbsp;email</h3>
<div class="outline-text-3" id="text-org28e1ed6">
<p>
Finally we&#8217;re ready to read email. I&#8217;ll leave this to you: there
are lots of text-based email clients around, notably <a href="http://www.mutt.org/"><code>mutt</code></a> that we
encountered earlier. There&#8217;s also <a href="https://www.djcbsoftware.nl/code/mu/mu4e.html"><code>mu4e</code></a> for reading email in
Emacs, making use of&nbsp;the <code>mu</code> index; and <a href="https://notmuch.readthedocs.io/en/latest/man1/notmuch.html"><code>notmuch</code></a> also has <a href="http://www.mutt.org/">an
Emacs interface</a>.
</p>

<p>
I&nbsp;use <code>mu4e</code>. There&#8217;s a lot of documentation on the web for setting
this up, all of which applies immediately to our new set-up: the
<span class="caps">MUA</span> is entirely independent of the <span class="caps">MDA</span> and <span class="caps">MTA</span>, and simply needs to
be pointed at the right directories and&nbsp;accounts.
</p>
</div>
</div>

<div id="outline-container-orgee7b61b" class="outline-3">
<h3 id="orgee7b61b">Accessing Gmail using&nbsp;<span class="caps">OAUTH2</span></h3>
<div class="outline-text-3" id="text-orgee7b61b">
<p>
Gmail lets one use &#8220;app passwords&#8221; for accessing using <span class="caps">IMAP</span>, but
also supports <span class="caps">OAUTH2</span>, which is obviously more secure. The same
approach as above works for Gmail too. The initial credentials&nbsp;are:
</p>

<div class="highlight"><pre><span></span>   <span class="n">GAppID</span> <span class="o">=</span> <span class="s1">'406964657835-aq8lmia8j95dhl1a2bvharmfk3t1hgqj.apps.googleusercontent.com'</span>
   <span class="n">GClientSecret</span> <span class="o">=</span> <span class="s1">'kSmqreRr0qwBWJgbf5Y-PjSU'</span>
</pre></div>

<p>
(<a href="https://www.dcs.gla.ac.uk/~jacobd/posts/2022/03/configure-mutt-to-work-with-oauth-20/">Same source</a> as above.) Edit these into the script and change the
entries in the config files to call it to authenticate with an
appropriate store, for&nbsp;example:
</p>

<div class="highlight"><pre><span></span>   mutt_oauth2.py -t .password-store/email/personal.gpg --authorize
</pre></div>

<p>
and similarly in the configurations&nbsp;of <code>mbsync</code> and <code>msmtp</code>.
</p>
</div>
</div>

<div id="outline-container-org0d519a7" class="outline-3">
<h3 id="org0d519a7">Conclusion</h3>
<div class="outline-text-3" id="text-org0d519a7">
<p>
If you&#8217;re still with me: congratulations, but you must <i>really</i>
want to read your email&nbsp;old-school!
</p>

<p>
For me, this has completely changed my relationship with email in
ways I didn&#8217;t expect. Using Emacs means typically not having the
client visible all the time, which reduces the temptation to check
all the time. Instead I can adopt a more structured approach and
only check my email when I want to, which often means only three or
four times a day. It&#8217;s also made email easier to manage, for
example by adding hyperlinks in my to-do list straight to messages
that need attention, and adding some integrations with org mode to
simplify email processing. Those are matters for another time,&nbsp;though.
</p>
</div>
</div>
